export const cyrCapital = [
  'А', 'Б', 'В', 'Г', 'Ғ', 'Д', 'Е', 'Ё', 'Ж', 'З',
  'И', 'Й', 'К', 'Қ', 'Л', 'М', 'Н', 'О', 'П', 'Р',
  'С', 'Т', 'У', 'Ў', 'Ф', 'Х', 'Ҳ', 'Ц', 'Ч', 'Ш',
  'Щ', 'Ъ', 'Ь', 'Э', 'Ю', 'Я', 'Ы'
];

export const cyrLowercase = [
  'а', 'б', 'в', 'г', 'ғ', 'д', 'е', 'ё', 'ж', 'з',
  'и', 'й', 'к', 'қ', 'л', 'м', 'н', 'о', 'п', 'р',
  'с', 'т', 'у', 'ў', 'ф', 'х', 'ҳ', 'ц', 'ч', 'ш',
  'щ', 'ъ', 'ь', 'э', 'ю', 'я', 'ы'
];

export const cyrUpperLowerMap = {};
cyrCapital.forEach((upper, idx) => {
  cyrUpperLowerMap[upper] = cyrLowercase[idx];
  cyrUpperLowerMap[cyrLowercase[idx]] = upper;
});

export const cyrVowel = [
  'А', 'Е', 'Ё', 'И', 'О', 'У', 'Ў', 'Э', 'Ю', 'Я', 'Ы',
  'а', 'е', 'ё', 'и', 'о', 'у', 'ў', 'э', 'ю', 'я', 'ы'
];

export const cyrConsonant = [
  'Б', 'В', 'Г', 'Ғ', 'Д', 'Ж', 'З', 'Й', 'К', 'Қ', 'Л', 'М', 'Н',
  'П', 'Р', 'С', 'Т', 'Ф', 'Х', 'Ҳ', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ь',
  'б', 'в', 'г', 'ғ', 'д', 'ж', 'з', 'й', 'к', 'қ', 'л', 'м', 'н',
  'п', 'р', 'с', 'т', 'ф', 'х', 'ҳ', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь'
];

export const cyrAll = [ ...cyrVowel, ...cyrConsonant ];

export const cyrMatch = [
  [ 'А', 'A' ],  [ 'Б', 'B' ],  [ 'В', 'V' ],  [ 'Г', 'G' ],
  [ 'Ғ', 'Gʻ' ], [ 'Д', 'D' ],  [ 'Е', 'E' ],  [ 'Ё', 'Yo' ],
  [ 'Ж', 'J' ],  [ 'З', 'Z' ],  [ 'И', 'I' ],  [ 'Й', 'Y' ],
  [ 'К', 'K' ],  [ 'Қ', 'Q' ],  [ 'Л', 'L' ],  [ 'М', 'M' ],
  [ 'Н', 'N' ],  [ 'О', 'O' ],  [ 'П', 'P' ],  [ 'Р', 'R' ],
  [ 'С', 'S' ],  [ 'Т', 'T' ],  [ 'У', 'U' ],  [ 'Ў', 'Oʻ' ],
  [ 'Ф', 'F' ],  [ 'Х', 'X' ],  [ 'Ҳ', 'H' ],  [ 'Ч', 'Ch' ],
  [ 'Ш', 'Sh' ], [ 'Щ', 'Sh' ], [ 'Ъ', 'ʼ' ],  [ 'Ь', '' ],
  [ 'Э', 'E' ],  [ 'Ю', 'Yu' ], [ 'Я', 'Ya' ], [ 'Ы', 'I' ], [ 'Ц', 'S' ],
  [ 'а', 'a' ],  [ 'б', 'b' ],  [ 'в', 'v' ],  [ 'г', 'g' ],
  [ 'ғ', 'gʻ' ], [ 'д', 'd' ],  [ 'е', 'e' ],  [ 'ё', 'yo' ],
  [ 'ж', 'j' ],  [ 'з', 'z' ],  [ 'и', 'i' ],  [ 'й', 'y' ],
  [ 'к', 'k' ],  [ 'қ', 'q' ],  [ 'л', 'l' ],  [ 'м', 'm' ],
  [ 'н', 'n' ],  [ 'о', 'o' ],  [ 'п', 'p' ],  [ 'р', 'r' ],
  [ 'с', 's' ],  [ 'т', 't' ],  [ 'у', 'u' ],  [ 'ў', 'oʻ' ],
  [ 'ф', 'f' ],  [ 'х', 'x' ],  [ 'ҳ', 'h' ],  [ 'ч', 'ch' ],
  [ 'ш', 'sh' ], [ 'щ', 'sh' ], [ 'ъ', 'ʼ' ],  [ 'ь', '' ],
  [ 'э', 'e' ],  [ 'ю', 'yu' ], [ 'я', 'ya' ], [ 'ы', 'i' ], [ 'ц', 's' ]
];

export const cyrMap = {};
cyrMatch.forEach(([ cyr, lat ]) => cyrMap[cyr] = lat);

export const latCapital = [
  'A', 'E', 'I', 'O', 'U',
  'B', 'C', 'D', 'F', 'G', 'H', 'J',
  'K', 'L', 'M', 'N', 'P', 'Q', 'R',
  'S', 'T', 'V', 'X', 'Y', 'Z',
  'Oʻ', 'O‘', 'O\'', 'Gʻ', 'G‘', 'G\''
];

export const latLowercase = [
  'a', 'e', 'i', 'o', 'u',
  'b', 'c', 'd', 'f', 'g', 'h', 'j',
  'k', 'l', 'm', 'n', 'p', 'q', 'r',
  's', 't', 'v', 'x', 'y', 'z',
  'oʻ', 'o‘', 'o\'', 'gʻ', 'g‘', 'g\''
];

export const latUpperLowerMap = {};
latCapital.forEach((upper, idx) => {
  latUpperLowerMap[upper] = latLowercase[idx];
  latUpperLowerMap[latLowercase[idx]] = upper;
});

export const latVowel = [
  'A', 'E', 'I', 'O', 'U', 'a', 'e', 'i', 'o', 'u',
  'Oʻ', 'O‘', 'O\'', 'oʻ', 'o‘', 'o\''
];

export const latConsonant = [
  'B', 'C', 'D', 'F', 'G', 'H', 'J',
  'K', 'L', 'M', 'N', 'P', 'Q', 'R',
  'S', 'T', 'V', 'X', 'Y', 'Z',
  'Gʻ', 'G‘', 'G\'',
  'b', 'c', 'd', 'f', 'g', 'h', 'j',
  'k', 'l', 'm', 'n', 'p', 'q', 'r',
  's', 't', 'v', 'x', 'y', 'z',
  'gʻ', 'g‘', 'g\'',
  'ʼ'
];

export const latAll = [ ...latVowel, ...latConsonant, 'ʼ' ];

export const latMatch = [
  [ 'A', 'А' ],  [ 'B', 'Б' ],  [ 'C', 'Ц' ],  [ 'D', 'Д' ],
  [ 'E', 'Е' ],  [ 'F', 'Ф' ],  [ 'G', 'Г' ],  [ 'H', 'Ҳ' ],
  [ 'I', 'И' ],  [ 'J', 'Ж' ],  [ 'K', 'К' ],  [ 'L', 'Л' ],
  [ 'M', 'М' ],  [ 'N', 'Н' ],  [ 'O', 'О' ],  [ 'P', 'П' ],
  [ 'Q', 'Қ' ],  [ 'R', 'Р' ],  [ 'S', 'С' ],  [ 'T', 'Т' ],
  [ 'U', 'У' ],  [ 'V', 'В' ],  [ 'X', 'Х' ],  [ 'Y', 'Й' ],
  [ 'Z', 'З' ],
  [ 'a', 'а' ],  [ 'b', 'б' ],  [ 'c', 'ц' ],  [ 'd', 'д' ],
  [ 'e', 'е' ],  [ 'f', 'ф' ],  [ 'g', 'г' ],  [ 'h', 'ҳ' ],
  [ 'i', 'и' ],  [ 'j', 'ж' ],  [ 'k', 'к' ],  [ 'l', 'л' ],
  [ 'm', 'м' ],  [ 'n', 'н' ],  [ 'o', 'о' ],  [ 'p', 'п' ],
  [ 'q', 'қ' ],  [ 'r', 'р' ],  [ 's', 'с' ],  [ 't', 'т' ],
  [ 'u', 'у' ],  [ 'v', 'в' ],  [ 'x', 'х' ],  [ 'y', 'й' ],
  [ 'z', 'з' ],  [ 'ʼ', 'ъ' ]
];

export const latDigraphMatch = [
  ['YA', 'Я'], ['YE', 'Е'], ['YO', 'Ё'],
  ['YU', 'Ю'], ['CH', 'Ч'], ['TS', 'Ц'], ['SH', 'Ш'],
  ['Ya', 'Я'], ['Ye', 'Е'], ['Yo', 'Ё'],
  ['Yu', 'Ю'], ['Ch', 'Ч'], ['Ts', 'Ц'], ['Sh', 'Ш'],
  ['ya', 'я'], ['ye', 'е'], ['yo', 'ё'],
  ['yu', 'ю'], ['ch', 'ч'], ['ts', 'ц'], ['sh', 'ш'],
  ['Oʻ', 'Ў'], ['Gʻ', 'Ғ'], ['oʻ', 'ў'], ['gʻ', 'ғ'],
  ['O‘', 'Ў'], ['G‘', 'Ғ'], ['o‘', 'ў'], ['g‘', 'ғ'],
  ['O\'', 'Ў'], ['G\'', 'Ғ'], ['o\'', 'ў'], ['g\'', 'ғ'],
]

export const vowelAll = [ ...cyrVowel, ...latVowel ];
export const consonantAll = [ ...cyrConsonant, ...latConsonant ];